  
// - створити функцію яка виводить масив
// function array(p) {
//     console.log(p);
// };
// array([1,2,3]);

// - створити функцію яка заповнює масив рандомними числами та виводить його. Для виведення використати попвередню функцію.

// function mass(length) {
//     let arr1 = [];
//       for (i=0; i <length; i++) {
//         arr1.push(Math.round(Math.random()* 100));
//     }
//     array(arr1)
// }
// mass(10); 

// - створити функцію яка приймає три числа та виводить та повертає найменьше.

// function funk(a,b,c){
//     let min = Math.min(a,b,c);
//     console.log(min);
// }
// funk(3,50,5)


// - створити функцію яка приймає три числа та виводить та повертає найбільше.

// function funk(a,b,c){
//     let max = Math.max(a,b,c);
//     console.log(max);
// }
// funk(30,2,7)

// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше

// function funk(a,b,c){
//     let max = Math.max(a,b,c);
//     console.log(max);
// }
// funk(30,2,7)

// function func(a,b,c) {
//     let min = Math.min (a,b,c)
//     let max = Math.max (a,b,c)
//     console.log(max);
//     console.log(min);
// }

// func(1,77,56)


// - створити функцію яка виводить масив

// function array(p) {
//     console.log(p);
// };
// array([100,24,13]);


// - створити функцію яка повертає найбільше число з масиву
// function array(a,b,c,d,e) {
//     let max = Math.max (a,b,c,d,e);
//     console.log(max);
// };
// array(100,24,13,3,77);


// - створити функцію яка повертає найменьше число з масиву

// function array(a,b,c,d,e) {
//     let min = Math.min (a,b,c,d,e);
//     console.log(min);
// };
// array(100,24,13,3,77);

// - створити функцію яка приймає масив чисел та складає значення елементів масиву та повертає його.



// - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.
// - Створити функцію яка приймає масив будь яких объектів, та повертає значення кількості об'єктів в масиві
// - Створити функцію яка приймає масив будь яких объектів, та повертає загальн кількість полів в них
// - створити функцію  яка скаладає значення елементів з однаковими індексами  та повертає новий результуючий масив.
//   Приклад
//   [1,2,3,4]
//   [2,3,4,5]
//   результат
//   [3,5,7,9]


